{
  "hello": "hello world",
  "home": "Home",
  "about": "About",
  "resume": "Resume",
  "contact": "Contact",
  "personal": {
    "fullname": "Tirawat Saijai",
    "nickname": "Beam"
  },
  "th_lang": "Thai",
  "en_lang": "English",
  "validate": {
    "fullname": "Name is required.",
    "emailline": "Email or Line is required.",
    "detail": "Please write something."
  },
  "fullname": "Fullname",
  "email": "Email",
  "emailline": "Email or Line",
  "write_something": "Write something",
  "form": {
    "submit": "Submit"
  },
  "confirm": "OK",
  "aboutme": {
    "present": "I have been working as a Web Developer for about 3 years, including over a year of freelancing during my spare time. Currently, I work at an insurance brokerage as a Fullstack Developer, but I primarily focus on Frontend. I also handle some Backend tasks using PHP and Golang (Gin framework). On the Frontend, I mostly work with Vue3 and Vite, although there are some older projects using PHP and JavaScript. While I prefer working on Frontend, I am capable of doing both, with greater proficiency in Frontend. During my freelancing work, I exclusively used Vue.js and Nuxt.js. Currently, I am planning to explore developing for LINE OA with a former team member in my free time.",
    "list1": "I am available to work 100% in the office or in a hybrid model, depending on the company's conditions.",
    "list2": "I am eager to learn new tech stacks or techniques.",
    "list3": "The reason I'm seeking a new job is that I'm looking for new challenges, opportunities to learn new things, and to further develop my skills and become even better at what I do.",
    "list4": "I can start within one month.",
    "list5": "I am willing to interview after 6:00 PM.",
    "list6": "I'm available in the afternoon on Mondays as I have a meeting in the morning."
  },
  "phone": "Phone",
  "website": "Website",
  "name": "Name",
  "birthdate": "Birthdate",
  "age": "Age",
  "ัexp_year": "Experience",
  "about_title": {
    "skill": "Developer Skill",
    "skill_other": "Highlight",
    "experience": "Experience",
    "education": "Education"
  },
  "learning": "Learning",
  "show_more": "Show More",
  "show_less": "Show Less",
  "month": {
    "jan": "Jan",
    "feb": "Feb",
    "mar": "Mar",
    "apr": "Apr",
    "may": "May",
    "jun": "Jun",
    "jul": "Jul",
    "aug": "Aug",
    "sep": "Sep",
    "oct": "Oct",
    "nov": "Nov",
    "dec": "Dec"
  },
  "year_unit": "year | years",
  "month_unit": "month | months",
  "current": "Current",
  "graduated": "Graduated",
  "lessoneyear": "Less than 1 year or currently learning.",
  "education": {
    "be_degree": "Bachelor's Degree, ",
    "be_degree_branch": "Information Technology",
    "be_degree_place": "Thonburi University",
    "hi_vocat": "Higher Vocational Certificate, ",
    "hi_vocat_brach": "Business Computer",
    "hi_vocat_place": "Mubankru Technology College"
  },
  "experience": {
    "go": {
      "name": "GO (THAILAND) COMPANY LIMITED",
      "detail": "At GO (THAILAND), I primarily work with ANC Insurtech, responsible for both the frontend and backend of the website prakun.com. The products I've worked on include cancer insurance, room charge insurance, life insurance, travel insurance, income compensation insurance, annual/monthly accident insurance, child insurance, annual/monthly car insurance, compulsory motor insurance, and foreign worker insurance. Additionally, there are some products that are either not yet listed for sale, not in use, or not directly related to insurance.",
      "detail_short": "Responsible for full-stack development of prakun.com under GO (Thailand) and ANC Insurtech. Worked on various insurance products, including cancer, life, travel, accident, auto, and migrant worker insurance. Focused on front-end tasks and API integration (PHP, Golang), excluding policy transmission to insurers. Also collaborated on Truemoney Wallet (Webview) integration for insurance sales.",
      "list1": "Responsible for both frontend and backend of the website prakun.com.",
      "list1_1": "Responsible for nearly all aspects of the frontend for products on the website. The only part not handled is sending APIs to request policies from insurance companies.",
      "list1_2": "Some APIs for retrieving various data points (using both PHP and Golang).",
      "list2": "Developed the website for foreign labor insurance at prakun.com/immigration.",
      "list2_1": "Responsible for almost everything except for exporting policies to insurance companies.",
      "list3": "I have previously worked with TrueMoney Wallet (Webview) for insurance sales.",
      "list3_1": "Responsible for the frontend."
    },
    "freelance": {
      "name": "Freelance",
      "detail_short": "Managed and developed the e-commerce website (Encore Fashion), responsible for the backend system (except APIs), frontend development (Nuxt.js), API adjustments (Gin Golang), database design, server setup (Lightsail Ubuntu), SSL installation, and reverse proxy configuration (Nginx). Additionally, developed job application and task reporting websites (Vue 3, Vite), handling only the frontend and database design. Also set up and maintained the backend server for UPL (Thailand), installed Cloudflare and SSL, and assisted with server setup for a research project at Mahidol University, based on client requirements.",
      "list1": "Developed the e-commerce website Encore Fashion using Vue 3, Vite, Nuxt.js, and Golang.",
      "list1_1": "Responsible for the backend management system (excluding APIs).",
      "list1_2": "Assisted with the frontend using Nuxt.js (worked on some parts later).",
      "list1_3": "Modified APIs for the frontend (using Gin Golang).",
      "list1_4": "Involved in database design.",
      "list1_5": "Set up servers on Lightsail with Ubuntu 20 for both frontend and backend (2 servers).",
      "list1_6": "Installed SSL from GoDaddy.",
      "list1_7": "Connected domain from GoDaddy and set up reverse proxy using Nginx.",
      "list2": "Developed frontend pages without API integration (Vue 3 Vite).",
      "list2_1": "Client hired specifically for the frontend work.",
      "list3": "Created the job application website for Sahasamakkhi Services using Vue 3 Vite and either Lumen Framework or Laravel.",
      "list3_1": "Developed the back office system, including database design.",
      "list4": "Built the task reporting system for TTP CARGO using Vue 3 Vite.",
      "list4_1": "Worked on the frontend and back office parts of the system.",
      "list4_2": "The task reporting system involves multiple levels of forwarding.",
      "list4_3": "The workflow is similar to chat, with regular file attachments.",
      "list4_4": "Assisted in database design.",
      "list5": "Took on server setup tasks for 2 projects:",
      "list5_1": "Set up and maintained the backend server for UPL (Thailand).",
      "list5_2": "Assisted in setting up the server for Mahidol University’s research project."
    },
    "bbp": {
      "name": "Big-Ben (Paints) Company Limited",
      "detail_short": "Developed company websites for both frontend and backend (CRUD, e-commerce), integrating the backend with the company’s local server. Designed databases and partially contributed to UX/UI design. Additionally, created a mockup website for a startup, set up the email system on Linux, and handled various support tasks, such as assisting users with device or network issues. Monitored CCTV systems (including a small project to display camera feeds on the web), installed facial recognition systems, and trained staff on how to use the system.",
      "list1": "Developed company websites for both frontend and backend.",
      "list1_1": "Implemented CRUD functionalities.",
      "list1_2": "Created an e-commerce website.",
      "list1_3": "Developed a backend system connected to the company’s local server.",
      "list1_4": "Designed the database system.",
      "list1_5": "Designed UX/UI (partially).",
      "list2": "Created a mockup website for a startup.",
      "list3": "Set up company email systems (Linux).",
      "list4": "Handled miscellaneous tasks:",
      "list4_1": "Provided support for network or server issues.",
      "list4_2": "Monitored and maintained company CCTV (including a small project to display cameras on the website with automatic rotation).",
      "list4_3": "Managed computer equipment issues (mice, keyboards, etc.).",
      "list4_4": "Installed a facial recognition system for data transmission to the main company server.",
      "list4_5": "Trained users on system usage."
    }
  },
  "tool": "Tools",
  "lib_tip": "JavaScript libraries, CSS frameworks, or popular libraries such as Bootstrap, jQuery, Select2, axios, etc."
}
