{
  "hello": "สวัสดีโลก",
  "home": "หน้าแรก",
  "about": "เกี่ยวกับ",
  "resume": "เรซูเม่",
  "contact": "ติดต่อ",
  "personal": {
    "fullname": "ถิรวัฒน์ สายใจ",
    "nickname": "บีม"
  },
  "th_lang": "ไทย",
  "en_lang": "อังกฤษ By Chat-gpt",
  "validate": {
    "fullname": "กรุณาระบุชื่อ",
    "emailline": "กรุณาระบุอีเมล์หรือไลน์",
    "detail": "เขียนอะไรซักหน่อยน้า"
  },
  "fullname": "ชื่อ",
  "email": "อีเมล์",
  "emailline": "อีเมล์หรือไลน์",
  "write_something": "เขียนไรซักหน่อย",
  "form": {
    "submit": "ส่ง"
  },
  "confirm": "ตกลง",
  "aboutme": {
    "present": "ทำงาน Web Developer รวมๆแล้ว 3 ปี แต่เป็น 3 ปีที่มีรับงานฟรีแลนซ์ (เวลาว่าง) 1 ปีกว่า ปัจจุบันทำงานอยู่กับนายหน้าบริษัทประกันเป็น Fullstack แต่เน้นไปทาง Frontend ซะส่วนใหญ่ มีทำ Backend บ้างใช้ php กับ golang (gin framework) ส่วนหน้าบ้านส่วนใหญ่จะใช้ vue3 vite มีงานเก่าๆ ที่ยังใช้ php+js อยู่บ้าง หลักๆแล้วชอบทำ Frontend มากกว่า Backend แต่ก็สามารถทำได้ทั้ง 2 แต่จะถนัด Frontend มากกว่าครับ ตอนทำฟรีแลนซ์จะใช้ vuejs, nuxtjs ทั้งหมด ปัจจุบันมีแพลนลองทำ LINE OA ในช่วงเวลาว่างกับเพื่อนที่เคยร่วมทีมกัน",
    "list1": "สามารถเข้า office ได้ 100% หรือ Hybrid ตามเงื่อนไขของบริษัท",
    "list2": "พร้อมเรียนรู้ Tech Stack หรือเทคนิคใหม่ๆ",
    "list3": "เหตุผลที่หางานใหม่ อยากได้ความท้าทายใหม่ๆ อยากเรียนรู้อะไรใหม่ๆ อยากพัฒนาตัวเองให้เก่งขึ้นมากกว่าเดิม",
    "list4": "สามารถเริ่มงานได้ใน 1 เดือน",
    "list5": "ยินดีสัมภาษณ์งานหลัง 18:00",
    "list6": "วันจันทร์สะดวกช่วงบ่าย เพราะช่วงเช้ามีประชุม"
  },
  "phone": "เบอร์โทรศัพท์",
  "website": "เว็บไซต์",
  "name": "ชื่อ",
  "birthdate": "วันเกิด",
  "age": "อายุ",
  "ัexp_year": "ประสบการณ์",
  "about_title": {
    "skill": "ความสามารถ",
    "skill_other": "ไฮไลท์",
    "experience": "ประสบการณ์การทำงาน",
    "education": "การศึกษา"
  },
  "learning": "กำลังเรียนรู้",
  "show_more": "แสดงเพิ่มเติม",
  "show_less": "แสดงน้อยลง",
  "month": {
    "jan": "ม.ค.",
    "feb": "ก.พ.",
    "mar": "มี.ค.",
    "apr": "เม.ย.",
    "may": "พ.ค.",
    "jun": "มิ.ย.",
    "jul": "ก.ค.",
    "aug": "ส.ค.",
    "sep": "ก.ย.",
    "oct": "ต.ค.",
    "nov": "พ.ย.",
    "dec": "ธ.ค."
  },
  "year_unit": "ปี",
  "month_unit": "เดือน",
  "current": "ปัจจุบัน",
  "graduated": "จบการศึกษา",
  "lessoneyear": "น้อยกว่า 1 ปีหรือกำลังเรียนรู้",
  "education": {
    "be_degree": "ปริญญาตรี",
    "be_degree_branch": "สาขาวิชาสารสนเทศ",
    "be_degree_place": "มหาวิทยาลัยธนบุรี",
    "hi_vocat": "ประกาศนียบัตรวิชาชีพชั้นสูง",
    "hi_vocat_brach": "สาขาวิชาคอมพิวเตอร์ธุรกิจ",
    "hi_vocat_place": "วิทยาลัยเทคโนโลยีหมู่บ้านครู"
  },
  "experience": {
    "go": {
      "name": "GO (THAILAND) COMPANY LIMITED",
      "detail": "GO (THAILAND) ทำงานขึ้นกับ ANC Insurtech เป็นหลัก รับผิดชอบเว็บไซต์ทั้งหน้าและหลังบ้าน prakun.com โปรดักส์ที่เคยผ่านมือก็มี ประกันมะเร็ง, ประกันค่างห้อง, ประกันชีวิต, ประกันเดินทาง, ประกันชดเชยรายได้, ประกันอุบัติเหตุ รายปี/รายเดือน, ประกันเด็ก, ประกันรถยนต์ รายปี/รายเดือน/พรบ., ประกันแรงงานต่างด้าว ยังมี Product บางตัวที่ไม่ได้ขึ้นขายหรือไม่ได้ใช้งานหรือที่ไม่ได้เกี่ยวกับประกันโดยตรง",
      "detail_short": "ดูแลการพัฒนาเว็บไซต์ prakun.com ทั้ง Frontend และ Backend ภายใต้ GO (Thailand) และ ANC Insurtech ทำงานกับผลิตภัณฑ์ประกันหลายประเภท เช่น ประกันมะเร็ง, ประกันชีวิต, ประกันเดินทาง, ประกันอุบัติเหตุ, ประกันรถยนต์ และประกันแรงงานต่างด้าว เน้นงานด้าน Frontend และเชื่อมต่อ API (PHP, Golang) ยกเว้นการส่งกรมธรรม์ร่วมกับบริษัทประกัน และร่วมงานกับ Truemoney Wallet (Webview) สำหรับการขายประกัน",
      "list1": "รับผิดชอบเว็บไซต์ทั้งหน้าและหลังบ้าน prakun.com",
      "list1_1": "รับผิดชอบ Product เกือบทุกตัวในส่วนของหน้าเว็บทั้งหมด ในด้าน Frontend ส่วนที่ไม่ได้ทำคือส่ง API ไปขอกรมธรรม์กับบริษัทประกัน",
      "list1_2": "Api บางจุดในการดึงข้อมูลต่างๆ (มีทั้ง php+golang)",
      "list2": "ทำเว็บประกันแรงงานต่างด้าว prakun.com/immigration",
      "list2_1": "รับผิดชอบเกือบทั้งหมดยกเว้นส่งออกกรมธรรม์กับบริษัทประกัน",
      "list3": "เคยทำงานร่วมกับ Truemoney Wallet (Webview) ส่วนขายประกัน",
      "list3_1": "รับผิดชอบในส่วน Frontend"
    },
    "freelance": {
      "name": "ฟรีแลนซ์",
      "detail_short": "ดูแลและพัฒนาเว็บไซต์ E-commerce (Encore Fashion) โดยรับผิดชอบระบบหลังบ้าน (ยกเว้น API) พัฒนาหน้าบ้าน (Nuxt.js) ปรับแก้ API (Gin Golang) ออกแบบฐานข้อมูล เซ็ตเซิร์ฟเวอร์ (Lightsail Ubuntu) ติดตั้ง SSL และ Reverse Proxy (Nginx) รวมถึงพัฒนาเว็บไซต์สมัครงานและระบบแจ้งงาน (Vue 3, Vite) โดยดูแลเฉพาะหน้าบ้านและออกแบบฐานข้อมูล พร้อมทั้งเซ็ตและดูแลเซิร์ฟเวอร์หลังบ้านของ UPL (ประเทศไทย) ติดตั้ง Cloudflare และ SSL และมีประสบการณ์ช่วยเซ็ตเซิร์ฟเวอร์สำหรับงานวิจัยของมหาวิทยาลัยมหิดลตามความต้องการของลูกค้า",
      "list1": "เว็บ E-commerce Encore Fashion (Vue 3 Vite, Nuxtjs, Golang)",
      "list1_1": "รับผิดชอบในส่วนของเว็บจัดการหลังบ้าน (ทั้งหมด ยกเว้น API)",
      "list1_2": "เข้าไปช่วยทำหน้าบ้านที่ใช้ Nuxt.js (เข้ามาทำทีหลังบางส่วน)",
      "list1_3": "มีปรับแก้ API สำหรับหน้าบ้าน (Gin Golang)",
      "list1_4": "มีส่วนในการออกแบบ Database",
      "list1_5": "เซ็ทเซิร์ฟเวอร์ Lightsail Ubuntu 20 2 เซิร์ฟ (ของหน้าบ้านและหลังบ้าน)",
      "list1_6": "ติดตั้ง SSL Godaddy",
      "list1_7": "เชื่อม Domain Godadddy และทำ Reserve proxy โดยใช้ nginx",
      "list2": "ตัดหน้าเว็บ Frontend ไม่มีการเชื่อม API (Vue3 Vite)",
      "list2_1": "ลูกค้าจ้างเฉพาะแค่หน้าบ้าน",
      "list3": "เว็บสมัครงานของสหสามัคคีบริการ (Vue3 Vite, Lumen Framework or Laravel",
      "list3_1": "เป็น Backoffice ระบบพนักงาน มีทั้งออกแบบฐานข้อมูล",
      "list4": "เว็บระบบแจ้งงาน TTP CARGO (Vue3 Vite)",
      "list4_1": "ทำหน้าบ้านในส่วนของ Backoffice",
      "list4_2": "ระบบแจ้งงานส่งต่อกันหลายเลเวล",
      "list4_3": "Flow การทำงานเหมือนส่งแชทกันมีการแนบไฟล์ปกติ",
      "list4_4": "มีช่วยออกแบบฐานข้อมูล",
      "list5": "รับงานเซ็ทเซิร์ฟเวอร์ 2 งาน",
      "list5_1": "เซ็ทและดูแลเซิร์ฟเวอร์หลังบ้านของ UPL (ประเทศไทย)",
      "list5_2": "ช่วยเซ็ทเซิฟเวอร์โปรเจ็คงานวิจัยของมหาลัยมหิดลบางส่วน"
    },
    "bbp": {
      "name": "Big-Ben (Paints) Company Limited",
      "detail_short": "พัฒนาเว็บไซต์บริษัททั้งหน้าบ้านและหลังบ้าน (CRUD, e-commerce) เชื่อมระบบหลังบ้านกับเซิร์ฟเวอร์ในบริษัท ออกแบบฐานข้อมูลและ UX/UI (บางส่วน) รวมถึงทำเว็บ Mockup สำหรับ Startup เซ็ตระบบอีเมลบน Linux และดูแลงานจิปาถะ เช่น ซัพพอร์ตผู้ใช้เมื่อติดปัญหากับอุปกรณ์หรือเครือข่าย ตรวจสอบกล้องวงจรปิด (เขียนโปรเจ็กต์เล็กๆ ให้กล้องแสดงผลบนเว็บ) ติดตั้งระบบสแกนหน้า และเทรนการใช้งานระบบให้พนักงาน",
      "list1": "ทำเว็บไซต์บริษัทหน้าบ้านและหลังบ้าน",
      "list1_1": "CRUD",
      "list1_2": "เว็บ e-commerce",
      "list1_3": "ทำระบบหลังบ้านเชื่อมกับเซิฟเวอร์ local ของบริษัท",
      "list1_4": "ออกแบบระบบฐานข้อมูล",
      "list1_5": "ออกแบบ ux/ui (บางส่วน)",
      "list2": "ทำเว็บ Mockup Startup",
      "list3": "เซ็ท E-mail ของบริษัท (linux)",
      "list4": "งานจิปาถะ (งานเล็กๆน้อยๆ)",
      "list4_1": "ซัพพอร์ทเวลาเครือข่ายเน็ตหรือเซิฟเวอร์ล่ม",
      "list4_2": "เช็คดูแลกล้องวงจรปิดของบริษัท (มีเขียนโปรเจ็คเล็กๆดึงกล้องมาโชว์ในเว็บ แล้วให้วนอัตโนมัติ)",
      "list4_3": "คอยรับเรื่องอุปกรณ์คอมฯ เสีย (เมาส์, คีย์บอร์ด, อื่นๆ)",
      "list4_4": "ติดตั้งระบบสแกนหน้า ให้ส่งข้อมูลผ่านเซิฟเวอร์มาบริษัทหลัก",
      "list4_5": "เทรนให้คนใช้ระบบ"
    }
  },
  "tool": "เครื่องมือ",
  "lib_tip": "Javascript Library, Css framework or lib ตัวหลักๆที่นิยมเช่น Bootstrap, jQuery, Select2, axios ฯลฯ"
}