const List = [
    {
        poisition_name: "Full Stack Developer",
        company_name: "Big-Ben (Paints) Company Limited",
        start: "2020-10-01",
        end: "2021-12-01",
        logo: "",
        descriptions: [
            {
                title: "ทำเว็บไซต์บริษัทหน้าบ้านและหลังบ้าน",
                subs: ["CRUD", "เว็บ e-commerce", "ทำระบบหลังบ้านเชื่อมกับเซิฟเวอร์ local ของบริษัท", "ออกแบบระบบฐานข้อมูล", "ออกแบบ ux/ui (บางส่วน)"]
            },
            {
                title: "ทำเว็บ Mockup Startup",
                subs: ["CRUD", "เว็บ e-commerce", "ทำระบบหลังบ้านเชื่อมกับเซิฟเวอร์ local ของบริษัท", "ออกแบบระบบฐานข้อมูล", "ออกแบบ ux/ui (บางส่วน)"]
            },
            {
                title: "เซ็ท E-mail ของบริษัท (linux)",
                subs: ["CRUD", "เว็บ e-commerce", "ทำระบบหลังบ้านเชื่อมกับเซิฟเวอร์ local ของบริษัท", "ออกแบบระบบฐานข้อมูล", "ออกแบบ ux/ui (บางส่วน)"]
            },
            {
                title: "งานจิปาถะ (งานเล็กๆน้อยๆ)",
                subs: [
                    "ซัพพอร์ท User เวลาคอมพิวเตอร์ เครื่องปริ้นหรืออะไรซักอย่างที่ใช้งานไม่ได้",
                    "ซัพพอร์ทเวลาเครือข่ายเน็ตหรือเซิฟเวอร์ล่ม",
                    "เช็คดูแลกล้องวงจรปิดของบริษัท (มีเขียนโปรเจ็คเล็กๆดึงกล้องมาโชว์ในเว็บ แล้วให้วนอัตโนมัติ)",
                    "คอยรับเรื่องอุปกรณ์คอมฯ เสีย (เมาส์, คีย์บอร์ด, อื่นๆ)",
                    "ติดตั้งระบบสแกนหน้า ให้ส่งข้อมูลผ่านเซิฟเวอร์มาบริษัทหลัก"
                ]
            },
            {
                title: "เทรนให้คนใช้ระบบ",
                subs: []
            },
        ],
    },
    {
        poisition_name: "Full Stack Developer",
        company_name: "ANC Insurtech",
        start: "2022-10-01",
        end: null,
        logo: "",
        descriptions: [
            {
                title: "ทำเว็บไซต์บริษัทหน้าบ้านและหลังบ้าน",
                subs: ["CRUD", "เว็บ e-commerce", "ทำระบบหลังบ้านเชื่อมกับเซิฟเวอร์ local ของบริษัท", "ออกแบบระบบฐานข้อมูล", "ออกแบบ ux/ui (บางส่วน)"]
            },
            {
                title: "ทำเว็บ Mockup Startup",
                subs: ["CRUD", "เว็บ e-commerce", "ทำระบบหลังบ้านเชื่อมกับเซิฟเวอร์ local ของบริษัท", "ออกแบบระบบฐานข้อมูล", "ออกแบบ ux/ui (บางส่วน)"]
            },
        ],
    },
    {
        poisition_name: "Full Stack Developer",
        company_name: "Freelance",
        start: "2023-10-01",
        end: "2024-01-01",
        logo: "",
        descriptions: [
            {
                title: "ทำเว็บไซต์บริษัทหน้าบ้านและหลังบ้าน",
                subs: ["CRUD", "เว็บ e-commerce", "ทำระบบหลังบ้านเชื่อมกับเซิฟเวอร์ local ของบริษัท", "ออกแบบระบบฐานข้อมูล", "ออกแบบ ux/ui (บางส่วน)"]
            },
            {
                title: "ทำเว็บ Mockup Startup",
                subs: ["CRUD", "เว็บ e-commerce", "ทำระบบหลังบ้านเชื่อมกับเซิฟเวอร์ local ของบริษัท", "ออกแบบระบบฐานข้อมูล", "ออกแบบ ux/ui (บางส่วน)"]
            },
        ],
    }
]

export { List }